[
    "Olá!  How can I help you today?\n",
    "Entendido.  A partir de agora, responderei em português.  Qual a sua pergunta ou solicitação?\n",
    "Olá!  Como posso ajudar?\n",
    "Olá!  Como posso ajudar você hoje?  Para te auxiliar da melhor forma possível, preciso que me diga qual o assunto relacionado a saúde suplementar te interessa. Posso te ajudar com informações sobre cobertura de procedimentos, carências, reembolso, auditoria médica, TUSS, tabelas médicas, ou autorização de exames e cirurgias.  Por favor, seja o mais específico possível na sua pergunta para que eu possa te dar a resposta mais precisa e completa.\n",
    "O reembolso de despesas médicas em planos de saúde é regulamentado pela ANS (Agência Nacional de Saúde Suplementar) e possui regras específicas que variam de acordo com o contrato firmado entre você e a operadora do seu plano.  Não existe um direito universal ao reembolso, sendo ele, em geral, uma opção oferecida por alguns planos, e não uma obrigação.  É fundamental consultar seu contrato para verificar se essa modalidade está prevista e quais são as suas condições.\n\n**Geralmente, para solicitar um reembolso, você deverá:**\n\n* **Ter realizado o procedimento ou tratamento em um prestador de serviço não credenciado à sua operadora.**  Se o serviço foi realizado em um prestador credenciado, o ideal é utilizar a rede credenciada e evitar o reembolso, pois o processo pode ser mais burocrático.\n* **Apresentar toda a documentação necessária.** Isso inclui: nota fiscal (original e cópia), relatório médico detalhado, receituário médico (quando aplicável),  comprovante de pagamento e outros documentos que a sua operadora solicitar.  A documentação incompleta pode atrasar ou impedir o reembolso.\n* **Respeitar os prazos estabelecidos em contrato.**  Cada plano possui prazos específicos para a solicitação de reembolso.  É crucial verificar esses prazos em seu contrato, pois o descumprimento pode levar à rejeição da solicitação.  Normalmente, os prazos são contados a partir da data da realização do procedimento ou do pagamento da despesa.\n* **Seguir os procedimentos da operadora.** Cada operadora possui um processo específico para solicitação de reembolso, que pode incluir formulários online, envio postal de documentos ou atendimento presencial.  É importante seguir as instruções da sua operadora para garantir o processamento da sua solicitação.\n\n**A ANS não define um prazo máximo para o reembolso**, mas determina que a operadora deve informar ao beneficiário, em seu contrato, o prazo para análise e liberação do reembolso.  Caso a operadora não atenda ao prazo estabelecido em seu contrato, você poderá recorrer à ANS para buscar seus direitos.\n\n**Pontos importantes a serem considerados:**\n\n* **Valores reembolsados:** O plano de saúde geralmente reembolsará apenas o valor compatível com sua tabela de referência ou com o valor praticado em sua rede credenciada, mesmo que você tenha pago um valor superior.\n* **Cobertura do procedimento:** O procedimento ou tratamento deve estar coberto pelo seu plano de saúde. Procedimentos não cobertos não serão reembolsados.\n* **Limites de reembolso:** Algumas operadoras possuem limites anuais ou mensais para reembolsos.\n* **Recusa de reembolso:** A operadora pode recusar o reembolso caso a documentação seja incompleta ou inconsistente, caso o procedimento não seja coberto pelo seu plano, ou por outros motivos previstos em contrato.\n\n\nEm caso de recusa do reembolso, é importante solicitar a justificativa por escrito da operadora e avaliar a possibilidade de recorrer administrativamente à ANS ou judicialmente.  Lembre-se de sempre guardar cópias de toda a documentação relacionada ao processo.  É recomendável também consultar um advogado especializado em direito do consumidor para entender melhor seus direitos e os caminhos legais disponíveis.\n",
    "O valor do procedimento é de R$ 100,00.\n",
    "O código do procedimento é 10101012.  Para saber se este procedimento está coberto pelo seu plano de saúde, preciso saber qual plano você possui e qual o seu tipo de cobertura.  É fundamental verificar se o código 10101012 consta no Rol de Procedimentos e Eventos em Saúde da ANS,  pois apenas os procedimentos listados lá são obrigatoriamente cobertos pelos planos de saúde.  A classificação 1 que você mencionou pode se referir a diferentes categorias dependendo da tabela utilizada (CBHPM, TUSS, etc.).  Por favor, forneça mais detalhes para que eu possa te ajudar melhor.  Qual a descrição do procedimento?\n",
    "O prazo para autorização de exames e cirurgias, de acordo com a legislação vigente,  é de até 10 dias úteis.  Lembre-se que este é o prazo máximo, e a operadora pode autorizar o procedimento antes desse período.  Você tem o direito de solicitar a autorização e acompanhar o processo.\n"
]